Revit 2024 API
Application.LoginUserId Property
 The user id of the user currently logged in. The user id will be empty if the user is not logged in.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public string LoginUserId { get; }
Visual Basic
Public ReadOnly Property LoginUserId As String
	Get
Visual C++
public:
property String^ LoginUserId {
	String^ get ();
}
Remarks
 The internal id of Autodesk ID that the current user has logged in to A360. This user id is in human unrecognizable form. In conjunction with the Store Entitlement REST API, a publisher of Autodesk Exchange Store app can verify if the current user has purchased their app from the store. For more information about Store Entitlement API, please refer to www.autodesk.com/developapps.
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace